espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_mac.c
/***************************************************************************//**
 * @file
 * @brief Silicon Labs PSA Crypto Transparent Driver Mac functions.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "em_device.h"

#if defined(CRYPTO_PRESENT)

#include "sli_crypto_transparent_functions.h"
#include "sli_psa_driver_common.h"
#include "crypto_management.h"
#include "psa/crypto.h"
#include "em_crypto.h"
#include "em_core.h"
#include <string.h>

#if defined(PSA_WANT_ALG_CMAC)

// Magic value for CMAC calculation.
// const_rb should be 0x87 according to the spec, but the implementation
// requires a bit- and byteswapped constant.
static const uint32_t cmac_const_rb[4] = { 0x00000000u, 0x00000000u,
                                           0x00000000u, 0xe1000000u };

static psa_status_t sli_crypto_cmac_compute(const uint8_t *input,
                                            uint32_t input_length,
                                            const uint8_t *key,
                                            const uint32_t key_length,
                                            uint8_t *iv,
                                            uint8_t *mac,
                                            uint16_t mac_length,
                                            const bool generate);

static psa_status_t sli_crypto_cmac_finalize(CRYPTO_TypeDef *crypto,
                                             bool generate,
                                             uint8_t *mac,
                                             uint16_t mac_length);

static psa_status_t sli_crypto_aes_crypt_cbc(const uint8_t *key_buffer,
                                             size_t key_buffer_size,
                                             psa_encrypt_or_decrypt_t mode,
                                             size_t length,
                                             uint8_t iv[16],
                                             const uint8_t *input,
                                             uint8_t *output);

#endif // PSA_WANT_ALG_CMAC

psa_status_t sli_crypto_transparent_mac_compute(const psa_key_attributes_t *attributes,
                                                const uint8_t *key_buffer,
                                                size_t key_buffer_size,
                                                psa_algorithm_t alg,
                                                const uint8_t *input,
                                                size_t input_length,
                                                uint8_t *mac,
                                                size_t mac_size,
                                                size_t *mac_length)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (attributes == NULL
      || key_buffer == NULL
      || input == NULL
      || mac == NULL
      || mac_size == 0
      || mac_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Take in the key
  if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
    return PSA_ERROR_NOT_SUPPORTED;
  }

  size_t key_len = psa_get_key_bits(attributes) / 8;
  switch (key_len) {
    case 16:
    case 32:
      if (key_buffer_size != key_len) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      break;
    case 24:
      return PSA_ERROR_NOT_SUPPORTED;
    default:
      return PSA_ERROR_INVALID_ARGUMENT;
  }

  psa_status_t status;
  uint16_t digest_length;
  uint8_t tmp_iv[16];

  switch (PSA_ALG_FULL_LENGTH_MAC(alg)) {
    case PSA_ALG_CMAC:
      digest_length = PSA_MAC_TRUNCATED_LENGTH(alg);
      if (digest_length == 0) {
        digest_length = PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES);
      }

      if (mac_size < digest_length) {
        return PSA_ERROR_BUFFER_TOO_SMALL;
      }

      // IV should always be zero when starting a new computation.
      memset(tmp_iv, 0, 16);
      status = sli_crypto_cmac_compute(input,
                                       input_length,
                                       key_buffer,
                                       key_len,
                                       tmp_iv,
                                       mac,
                                       digest_length,
                                       true);
      *mac_length = digest_length;
      break;
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  return status;

#else // PSA_WANT_ALG_CMAC

  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  (void)input;
  (void)input_length;
  (void)mac;
  (void)mac_size;
  (void)mac_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

psa_status_t sli_crypto_transparent_mac_sign_setup(sli_crypto_transparent_mac_operation_t *operation,
                                                   const psa_key_attributes_t *attributes,
                                                   const uint8_t *key_buffer,
                                                   size_t key_buffer_size,
                                                   psa_algorithm_t alg)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (operation == NULL
      || attributes == NULL
      || (key_buffer == NULL && key_buffer_size > 0)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Start by resetting the context
  memset(operation, 0, sizeof(*operation));

  // Take in the key
  if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
    return PSA_ERROR_NOT_SUPPORTED;
  }

