espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_mac.c
  if (!PSA_ALG_IS_MAC(alg)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  switch (PSA_ALG_FULL_LENGTH_MAC(alg)) {
    case PSA_ALG_CMAC:
      operation->cipher_mac.alg = alg;
      break;
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  operation->cipher_mac.key_len = psa_get_key_bits(attributes) / 8;
  if (operation->cipher_mac.key_len > key_buffer_size) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  switch (operation->cipher_mac.key_len) {
    case 16:
    case 32:
      if (key_buffer_size != operation->cipher_mac.key_len) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      memcpy(operation->cipher_mac.key, key_buffer, operation->cipher_mac.key_len);
      break;
    case 24:
      return PSA_ERROR_NOT_SUPPORTED;
    default:
      return PSA_ERROR_INVALID_ARGUMENT;
  }

  return PSA_SUCCESS;

#else // PSA_WANT_ALG_CMAC

  (void)operation;
  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

psa_status_t sli_crypto_transparent_mac_verify_setup(sli_crypto_transparent_mac_operation_t *operation,
                                                     const psa_key_attributes_t *attributes,
                                                     const uint8_t *key_buffer,
                                                     size_t key_buffer_size,
                                                     psa_algorithm_t alg)
{
  // Since the PSA Crypto core exposes the verify functionality of the drivers without
  // actually implementing the fallback to 'sign' when the driver doesn't support verify,
  // we need to do this ourselves for the time being.
  return sli_crypto_transparent_mac_sign_setup(operation,
                                               attributes,
                                               key_buffer,
                                               key_buffer_size,
                                               alg);
}

psa_status_t sli_crypto_transparent_mac_update(sli_crypto_transparent_mac_operation_t *operation,
                                               const uint8_t *input,
                                               size_t input_length)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (operation == NULL
      || (input == NULL && input_length > 0)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  psa_status_t status;

  switch (PSA_ALG_FULL_LENGTH_MAC(operation->cipher_mac.alg)) {
    case PSA_ALG_CMAC: {
      // The streaming update operation of CMAC is like doing CBC-MAC but
      // always keeping the last block as a plaintext.
      if (input_length == 0) {
        return PSA_SUCCESS;
      }

      // Add the beginning of the input data to last unprocessed block and hash
      // it if the input is big enough to cause a new last block to be made.
      if ((operation->cipher_mac.unprocessed_len > 0)
          && (input_length > 16 - operation->cipher_mac.unprocessed_len)) {
        memcpy(&operation->cipher_mac.unprocessed_block[operation->cipher_mac.unprocessed_len],
               input,
               16 - operation->cipher_mac.unprocessed_len);

        status = sli_crypto_aes_crypt_cbc(operation->cipher_mac.key,
                                          operation->cipher_mac.key_len,
                                          PSA_CRYPTO_DRIVER_ENCRYPT,
                                          16,
                                          operation->cipher_mac.iv,
                                          operation->cipher_mac.unprocessed_block,
                                          operation->cipher_mac.iv);

        if (status != PSA_SUCCESS) {
          return PSA_ERROR_HARDWARE_FAILURE;
        }

        input += 16 - operation->cipher_mac.unprocessed_len;
        input_length -= 16 - operation->cipher_mac.unprocessed_len;
        operation->cipher_mac.unprocessed_len = 0;
      }

      // Block count including last block
      size_t block_count = (input_length + 16 - 1) / 16;

      // Hash all full blocks except for the last one
      for (uint32_t i = 1; i < block_count; ++i) {
        status = sli_crypto_aes_crypt_cbc(operation->cipher_mac.key,
                                          operation->cipher_mac.key_len,
                                          PSA_CRYPTO_DRIVER_ENCRYPT,
                                          16,
                                          operation->cipher_mac.iv,
                                          input,
                                          operation->cipher_mac.iv);

        if (status != PSA_SUCCESS) {
          return PSA_ERROR_HARDWARE_FAILURE;
        }

        input_length -= 16;
        input += 16;
      }

      // Add remaining input data that wasn't aligned to a block
      if (input_length > 0) {
        memcpy(&operation->cipher_mac.unprocessed_block[operation->cipher_mac.unprocessed_len],
               input,
               input_length);
        operation->cipher_mac.unprocessed_len += input_length;
      }
      break;
    }
    default:
      return PSA_ERROR_BAD_STATE;
  }

  return PSA_SUCCESS;

#else // PSA_WANT_ALG_CMAC

  (void)operation;
  (void)input;
  (void)input_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

psa_status_t sli_crypto_transparent_mac_sign_finish(sli_crypto_transparent_mac_operation_t *operation,
                                                    uint8_t *mac,
                                                    size_t mac_size,
                                                    size_t *mac_length)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (operation == NULL
      || mac == NULL
      || mac_size == 0
      || mac_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  psa_status_t status;
  uint16_t digest_length;

  switch (PSA_ALG_FULL_LENGTH_MAC(operation->cipher_mac.alg)) {
    case PSA_ALG_CMAC:
      digest_length = PSA_MAC_TRUNCATED_LENGTH(operation->cipher_mac.alg);
      if (digest_length == 0) {
        digest_length = PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES);
      }

      if (mac_size < digest_length) {
        return PSA_ERROR_BUFFER_TOO_SMALL;
      }

