espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_mac.c
      // Calling the cmac compute function with the input set to the last
      // block and the IV set to the current hash is equal to running the
      // finalize operation.
      status = sli_crypto_cmac_compute(operation->cipher_mac.unprocessed_block,
                                       operation->cipher_mac.unprocessed_len,
                                       operation->cipher_mac.key,
                                       operation->cipher_mac.key_len,
                                       operation->cipher_mac.iv,
                                       mac,
                                       digest_length,
                                       true);

      if (status != PSA_SUCCESS) {
        return PSA_ERROR_HARDWARE_FAILURE;
      }

      *mac_length = digest_length;
      break;
    default:
      return PSA_ERROR_BAD_STATE;
  }

  return PSA_SUCCESS;

#else // PSA_WANT_ALG_CMAC

  (void)operation;
  (void)mac;
  (void)mac_size;
  (void)mac_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

psa_status_t sli_crypto_transparent_mac_verify_finish(sli_crypto_transparent_mac_operation_t *operation,
                                                      const uint8_t *mac,
                                                      size_t mac_length)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (operation == NULL
      || mac == NULL
      || mac_length == 0) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  uint16_t digest_length;

  switch (PSA_ALG_FULL_LENGTH_MAC(operation->cipher_mac.alg)) {
    case PSA_ALG_CMAC:
      digest_length = PSA_MAC_TRUNCATED_LENGTH(operation->cipher_mac.alg);
      if (digest_length == 0) {
        digest_length = PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES);
      }

      if (mac_length != digest_length) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }

      // Calling the cmac compute function with the input set to the last
      // block and the IV set to the current hash is equal to running the
      // finalize operation.
      return sli_crypto_cmac_compute(operation->cipher_mac.unprocessed_block,
                                     operation->cipher_mac.unprocessed_len,
                                     operation->cipher_mac.key,
                                     operation->cipher_mac.key_len,
                                     operation->cipher_mac.iv,
                                     (uint8_t*)mac,
                                     mac_length,
                                     false);
    default:
      return PSA_ERROR_BAD_STATE;
  }

#else // PSA_WANT_ALG_CMAC

  (void)operation;
  (void)mac;
  (void)mac_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

psa_status_t sli_crypto_transparent_mac_abort(sli_crypto_transparent_mac_operation_t *operation)
{
#if defined(PSA_WANT_ALG_CMAC)

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // There's no state in hardware that we need to preserve, so zeroing out the context suffices.
  memset(operation, 0, sizeof(*operation));
  return PSA_SUCCESS;

#else // PSA_WANT_ALG_CMAC

  (void)operation;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CMAC
}

#if defined(PSA_WANT_ALG_CMAC)

/**
 * @brief
 *  Function is an implementation of CMAC-AES (128 or 256 bit key)
 *
 * @param[in] input
 *  Pointer to data (message)
 *
 * @param[in] input_length
 *  length of input buffer in bytes
 *
 * @param[in] key
 *  Pointer to key buffer for the AES algorithm.
 *  Has to be 16 or 32 bytes long, for AES-128 and AES-256 respectively.
 *
 * @param[in] key_length
 *   The length of the key in bytes. Either 16 (AES-128) or 32 (AES-256).
 *
 * @param[in] iv
 *  128-bit initialization vector used in the CBC part of CMAC. Should be zero
 *  unless the call is used as a finalize operation of an unfinished digest, in
 *  which case it should be set to the current intermediate digest.
 *
 * @param[in/out] mac
 *  16-byte (maximum) MAC buffer. If generating, the MAC will be stored there.
 *  If verifying, the calculated MAC will be compared to the one stored in
 *  this buffer.
 *
 * @param[in] mac_length
 *  Requested length of the message digest in bytes. Can be at most a full-
 *  length output, i.e. 16 bytes.
 *
 * @param[in] generate
 *  true - Generate MAC
 *  false - Verify MAC
 *
 * @return
 *   PSA_SUCCESS if success. Error code if failure.
 *   Encryption will always succeed.
 *   Decryption may fail if the authentication fails.
 */
static psa_status_t sli_crypto_cmac_compute(const uint8_t *input,
                                            uint32_t input_length,
                                            const uint8_t *key,
                                            const uint32_t key_length,
                                            uint8_t *iv,
                                            uint8_t *mac,
                                            uint16_t mac_length,
                                            const bool generate)

{
  CORE_DECLARE_IRQ_STATE;
  uint32_t i;
  uint32_t subKey[4];
  uint32_t lastBlock[4];
  uint8_t *lastBlockBytePtr = (uint8_t *)lastBlock;
  uint8_t bytesToPad;
  psa_status_t status;
  size_t full_blocks_min_one =
    (input_length > 0 ? (input_length - 1) / 16 : 0);
  CRYPTO_TypeDef *crypto = crypto_management_acquire();

  /* Check input arguments */
  if (mac_length > 16
      || mac_length == 0
      || key == NULL
      || (key_length != 16U && key_length != 32U)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  CORE_ENTER_CRITICAL();

  /* Reset CRYPTO registers */
  crypto->CTRL = 0;
  crypto->SEQCTRL  = 0;
  crypto->SEQCTRLB = 0;

  /* Zero out DDATA0 and DDATA2 */
  CRYPTO_EXECUTE_2(crypto,
                   CRYPTO_CMD_INSTR_CLR,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA2);

  /* Calculate subkeys */
  /* magic value in DATA1 */
  CRYPTO_DataWrite(&crypto->DATA1, cmac_const_rb);

  /* Key in KeyBuf */
  CRYPTO_KeyBufWriteUnaligned(crypto,
                              key,
                              (key_length == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  CRYPTO_EXECUTE_17(crypto,
                    CRYPTO_CMD_INSTR_SELDATA0DATA1,
                    CRYPTO_CMD_INSTR_AESENC,
                    CRYPTO_CMD_INSTR_BBSWAP128,
                    CRYPTO_CMD_INSTR_SELDDATA0DATA1,
                    CRYPTO_CMD_INSTR_SHR,
                    CRYPTO_CMD_INSTR_EXECIFCARRY,
                    CRYPTO_CMD_INSTR_XOR,
                    CRYPTO_CMD_INSTR_EXECALWAYS,
                    CRYPTO_CMD_INSTR_BBSWAP128,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA3, // subkey1 in DATA2
                    CRYPTO_CMD_INSTR_BBSWAP128,
                    CRYPTO_CMD_INSTR_SHR,
                    CRYPTO_CMD_INSTR_EXECIFCARRY,
                    CRYPTO_CMD_INSTR_XOR,
                    CRYPTO_CMD_INSTR_EXECALWAYS,
                    CRYPTO_CMD_INSTR_BBSWAP128,
                    CRYPTO_CMD_INSTR_DDATA0TODDATA2 // subkey2 in DATA0
                    );
  CRYPTO_InstructionSequenceWait(crypto);

  /* Prepare input message for algorithm */
  bytesToPad = 16 - (input_length % 16);

  /* Determine which subKey we're going to use */
  if (bytesToPad != 16 || input_length == 0) {
    /* Input is treated as last block being incomplete */
    /* So store SubKey 2 */
    CRYPTO_DataRead(&crypto->DATA0, subKey);
  } else {
    /* Input is treated as block aligned, so store SubKey 1 */
    CRYPTO_DataRead(&crypto->DATA2, subKey);
  }

  /* We can take a break from using CRYPTO here */
  CORE_EXIT_CRITICAL();

  /* Copy the last block of data into our local copy because we need
     to change it */
  memset(lastBlock, 0, sizeof(lastBlock));
  memcpy(lastBlock,
         &input[full_blocks_min_one * 16],
         (input_length - (full_blocks_min_one * 16)));

  if (bytesToPad != 16) {
    /* Input message needs to be padded */
    lastBlockBytePtr[16 - bytesToPad] = 0x80;
    if (bytesToPad > 1) {
      memset(&lastBlockBytePtr[16 - bytesToPad + 1], 0x00, bytesToPad - 1);
    }
  } else if (input_length == 0) {
    /* No data: set the 'last block' to immediate termination */
    memset(lastBlock, 0, sizeof(lastBlock));
    lastBlockBytePtr[0] = 0x80;
  } else {
    /* Input message was block-aligned, so no padding required */
  }
  /* Store the XOR-ed version of the last block separate from the message */
  /* to avoid contamination of the input data */
  for (i = 0; i < 4; i++) {
    lastBlock[i] ^= subKey[i];
  }

  /* Calculate hash */
  CORE_ENTER_CRITICAL();

  crypto->SEQCTRL |= 16;

