espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_mac.c
  CRYPTO_KeyBufWriteUnaligned(crypto,
                              key,
                              (key_length == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  CRYPTO_DataWriteUnaligned(&crypto->DATA0, iv);

  /* Push all blocks except the last one */
  for (i = 0; i < full_blocks_min_one; i++) {
    CRYPTO_DataWriteUnaligned(&crypto->DATA0XOR, &input[i * 16]);
    CRYPTO_EXECUTE_1(crypto, CRYPTO_CMD_INSTR_AESENC);
  }
  /* Don't forget to push the last block as well! */
  CRYPTO_DataWrite(&crypto->DATA0XOR, lastBlock);
  CRYPTO_EXECUTE_1(crypto, CRYPTO_CMD_INSTR_AESENC);
  CRYPTO_InstructionSequenceWait(crypto);

  status = sli_crypto_cmac_finalize(crypto, generate, mac, mac_length);

  CORE_EXIT_CRITICAL();

  crypto_management_release(crypto);

  return status;
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *   Perform final CMAC processing.
 *
 * @param[in] generate
 *   True if MAC generation was requested.
 *   False if MAC verification was requested.
 *
 * @param[in/out] mac
 *   Pointer to location where the calculated CMAC MAC should be stored when
 *   encrypting, or where the to-be-verified MAC is located for verification.
 *
 * @param[in] mac_length
 *   Output length of the calculated MAC (in bytes).
 ******************************************************************************/
static psa_status_t sli_crypto_cmac_finalize(CRYPTO_TypeDef *crypto,
                                             bool generate,
                                             uint8_t *mac,
                                             uint16_t mac_length)
{
  uint32_t full_mac[4];
  psa_status_t status;

  if (mac_length > sizeof(full_mac)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  /* Read calculated MAC from CRYPTO. */
  CRYPTO_DataRead(&crypto->DATA0, full_mac);

  if (generate) {
    /* copy requested output to passed buffer */
    memcpy(mac, full_mac, mac_length);
    status = PSA_SUCCESS;
  } else {
    /* Compare the MAC with the reference value in constant time */
    status = sli_psa_safer_memcmp((const uint8_t*)mac, (const uint8_t*)full_mac, mac_length) == 0 ? PSA_SUCCESS : PSA_ERROR_INVALID_SIGNATURE;
  }

  memset(full_mac, 0, sizeof(full_mac));
  return status;
}

/*
 * AES-CBC buffer encryption/decryption
 *
 * NOTE: The input and output buffers must not overlap.
 */
static psa_status_t sli_crypto_aes_crypt_cbc(const uint8_t *key_buffer,
                                             size_t key_buffer_size,
                                             psa_encrypt_or_decrypt_t mode,
                                             size_t length,
                                             uint8_t iv[16],
                                             const uint8_t *input,
                                             uint8_t *output)
{
  CORE_DECLARE_IRQ_STATE;
  size_t processed = 0;

  CRYPTO_TypeDef *device = crypto_management_acquire();
  device->WAC = 0;
  device->CTRL = 0;

  // Set the encryption/decryption key and input data
  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(device,
                              key_buffer,
                              (key_buffer_size == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);
  if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
    CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)iv);
  } else {
    CRYPTO_DataWriteUnaligned(&device->DATA2, (uint8_t *)iv);
  }
  CORE_EXIT_CRITICAL();

  while (processed < length) {
    if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0XOR, (uint8_t *)(&input[processed]));

      // Initiate encryption and wait for it to complete
      device->CMD = CRYPTO_CMD_INSTR_AESENC;
      while ((device->STATUS & CRYPTO_STATUS_INSTRRUNNING) != 0) ;

      CRYPTO_DataReadUnaligned(&device->DATA0, output);
      CORE_EXIT_CRITICAL();
    } else {
      // Decrypt input block, XOR IV to decrypted text, set ciphertext as next IV
      CORE_ENTER_CRITICAL();
      CRYPTO_DataWriteUnaligned(&device->DATA0, (uint8_t *)(&input[processed]));

      // Initiate decryption sequence and wait for it to complete
      CRYPTO_EXECUTE_4(device,
                       CRYPTO_CMD_INSTR_DATA0TODATA1,
                       CRYPTO_CMD_INSTR_AESDEC,
                       CRYPTO_CMD_INSTR_DATA2TODATA0XOR,
                       CRYPTO_CMD_INSTR_DATA1TODATA2);

      while ((device->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;

      CRYPTO_DataReadUnaligned(&device->DATA0, &output[processed]);
      CORE_EXIT_CRITICAL();
    }
    processed += 16;
  }

  if (processed >= 16) {
    // Update the supplied IV
    if (mode == PSA_CRYPTO_DRIVER_ENCRYPT) {
      memcpy(iv, &output[processed - 16], 16);
    } else {
      CORE_ENTER_CRITICAL();
      CRYPTO_DataReadUnaligned(&device->DATA2, iv);
      CORE_EXIT_CRITICAL();
    }
  }

  crypto_management_release(device);

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_CMAC

#endif // defined(CRYPTO_PRESENT)
